
<details><summary>Show Plan</summary>

``` terraform
terraform
module.lambda.null_resource.docker_tag: Refreshing state... [id=9061425206599045229]
module.lambda.null_resource.docker_push: Refreshing state... [id=6004933638252923688]
module.lambda.null_resource.docker_build: Refreshing state... [id=5862548276566171109]
module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-hello_world]
module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=modl-hello-lambda-logs]
module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-hello-lambda-logs]
module.lambda.aws_s3_bucket.b: Refreshing state... [id=modl-test-data]
module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-hello-lambda]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio-modl.com]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=E2E51DTG2P23PH]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_jupyter-sdk.curibio-modl.com_CNAME]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.aws_ecr_repository.ecr will be destroyed
  - resource "aws_ecr_repository" "ecr" {
      - arn                  = "arn:aws:ecr:us-east-1:725604423866:repository/modl-hello_world" -> null
      - id                   = "modl-hello_world" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "modl-hello_world" -> null
      - registry_id          = "725604423866" -> null
      - repository_url       = "725604423866.dkr.ecr.us-east-1.amazonaws.com/modl-hello_world" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # module.lambda.aws_s3_bucket.b will be destroyed
  - resource "aws_s3_bucket" "b" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::modl-test-data" -> null
      - bucket                      = "modl-test-data" -> null
      - bucket_domain_name          = "modl-test-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "modl-test-data.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "modl-test-data" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.lambda.null_resource.docker_build will be destroyed
  - resource "null_resource" "docker_build" {
      - id       = "5862548276566171109" -> null
      - triggers = {
          - "hash" = "a5954a7063f61d06210134335019ae28"
        } -> null
    }

  # module.lambda.null_resource.docker_push will be destroyed
  - resource "null_resource" "docker_push" {
      - id       = "6004933638252923688" -> null
      - triggers = {
          - "hash" = "a5954a7063f61d06210134335019ae28"
        } -> null
    }

  # module.lambda.null_resource.docker_tag will be destroyed
  - resource "null_resource" "docker_tag" {
      - id       = "9061425206599045229" -> null
      - triggers = {
          - "hash" = "a5954a7063f61d06210134335019ae28"
        } -> null
    }

  # module.sdk_analysis.aws_s3_bucket.analyzed_bucket will be created
  + resource "aws_s3_bucket" "analyzed_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "modl-sdk-analyzed"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.sdk_analysis.aws_s3_bucket.upload_bucket will be created
  + resource "aws_s3_bucket" "upload_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "modl-sdk-upload"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.sdk_analysis.aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = (known after apply)
          + queue_arn = (known after apply)
        }
    }

  # module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter will be created
  + resource "aws_sqs_queue" "sdk_queue_deadletter" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "modl-sdk-queue-deadletter"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.sdk_analysis.aws_sqs_queue.sdk_upload_queue will be created
  + resource "aws_sqs_queue" "sdk_upload_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "modl-sdk-upload-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be destroyed
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-hello-lambda" -> null
      - id                = "/aws/lambda/modl-hello-lambda" -> null
      - name              = "/aws/lambda/modl-hello-lambda" -> null
      - retention_in_days = 0 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be destroyed
  - resource "aws_iam_policy" "logs" {
      - arn       = "arn:aws:iam::725604423866:policy/modl-hello-lambda-logs" -> null
      - id        = "arn:aws:iam::725604423866:policy/modl-hello-lambda-logs" -> null
      - name      = "modl-hello-lambda-logs" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-hello-lambda:*:*",
                          - "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-hello-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA2R4LE3C5MJAW62O57" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be destroyed
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "modl-hello-lambda-logs" -> null
      - name       = "modl-hello-lambda-logs" -> null
      - policy_arn = "arn:aws:iam::725604423866:policy/modl-hello-lambda-logs" -> null
      - roles      = [
          - "modl-hello-lambda",
        ] -> null
      - users      = [] -> null
    }

  # module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be destroyed
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::725604423866:role/modl-hello-lambda" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-03-16T22:31:50Z" -> null
      - force_detach_policies = true -> null
      - id                    = "modl-hello-lambda" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::725604423866:policy/modl-hello-lambda-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "modl-hello-lambda" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA2R4LE3C5MGNBBAIYN" -> null

      - inline_policy {}
    }

  # module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be destroyed
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:us-east-1:725604423866:function:modl-hello-lambda" -> null
      - description                    = "Hello world lambda" -> null
      - function_name                  = "modl-hello-lambda" -> null
      - id                             = "modl-hello-lambda" -> null
      - image_uri                      = "725604423866.dkr.ecr.us-east-1.amazonaws.com/modl-hello_world:latest" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:725604423866:function:modl-hello-lambda/invocations" -> null
      - last_modified                  = "2021-03-16T22:32:01.217+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Image" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:725604423866:function:modl-hello-lambda:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::725604423866:role/modl-hello-lambda" -> null
      - source_code_hash               = "43a3646a6f7ba1eca9bb4aa6461e20a800d948859eada046f2e862f2a21da690" -> null
      - source_code_size               = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.sdk_analysis.module.ecs_task.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "modl-sdk_analysis-ecs-task-definition"
      + task_role_arn   = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs will be created
  + resource "aws_cloudwatch_log_group" "sdk-analysis-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "modl-sdk-analysis"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "sdk-analysis"
          + "Environment" = "modl"
        }
      + tags_all          = {
          + "Application" = "sdk-analysis"
          + "Environment" = "modl"
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a will be created
  + resource "aws_default_subnet" "default_subnet_a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b will be created
  + resource "aws_default_subnet" "default_subnet_b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c will be created
  + resource "aws_default_subnet" "default_subnet_c" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc will be created
  + resource "aws_default_vpc" "default_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = (known after apply)
      + cidr_block                       = (known after apply)
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "modl-sdk_analysis"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster will be created
  + resource "aws_ecs_cluster" "aws-ecs-cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "modl-sdk_analysis-cluster"
      + tags     = {
          + "Name" = "modl-sdk_analysis-ecs"
        }
      + tags_all = {
          + "Name" = "modl-sdk_analysis-ecs"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "modl-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task will be created
  + resource "aws_ecs_task_definition" "aws-ecs-task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "modl-sdk_analysis-ecs-task-definition"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole will be created
  + resource "aws_iam_role" "ecsTaskExecutionRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-sdk_analysis-execution-task-role"
      + path                  = "/"
      + tags                  = {
          + "Name" = "modl-sdk_analysis-iam-role"
        }
      + tags_all              = {
          + "Name" = "modl-sdk_analysis-iam-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-sdk_analysis-ecs_task_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "modl-sdk_analysis-ecs_inline_policy"
          + policy = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "modl-sdk_analysis-execution-task-role"
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_build will be created
  + resource "null_resource" "docker_build" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "ee952fcbe3d715212524c7e0be42bb8d"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "ee952fcbe3d715212524c7e0be42bb8d"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "ee952fcbe3d715212524c7e0be42bb8d"
        }
    }

  # module.sdk_analysis.module.lambda.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "modl-sdk_upload"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_build will be created
  + resource "null_resource" "docker_build" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = ""
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = ""
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = ""
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "s3put"
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/modl-sdk-upload-lambda"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "modl-sdk-upload-lambda-inline"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "modl-sdk-upload-lambda-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + name       = "modl-sdk-upload-lambda"
      + policy_arn = (known after apply)
      + roles      = [
          + "modl-sdk-upload-lambda",
        ]
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "modl-sdk-upload-lambda-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "modl-sdk-upload-lambda",
        ]
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-sdk-upload-lambda"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Handle sdk data upload"
      + function_name                  = "modl-sdk-upload-lambda"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET" = "modl-sdk-upload"
              + "SQS_NAME"  = "modl-sdk-upload-queue"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 31 to add, 0 to change, 10 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @jperson